# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadCase..::..Create Method
LoadCase Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, String, ElementId, ElementId) | Creates a new LoadCase. |
| Create(Document, String, ElementId, LoadCaseCategory) | Creates a new LoadCase. |

# See Also
LoadCase Class
LoadCase Members
Autodesk.Revit.DB.Structure Namespace